brew "colima"
brew "docker"
brew "fd"
brew "fish"
brew "fzf"
brew "lazygit"
brew "lua-language-server"
brew "neovim"
brew "node"
brew "pipx"
brew "python@3.12"
brew "ripgrep"
brew "rust-analyzer"
brew "starship"

cask "arc"
cask "kitty"
cask "mac-mouse-fix"
cask "swish"

tap "homebrew/cask-fonts"
cask "font-jetbrains-mono-nerd-font"

brew "mas"
mas "Tailscale", id: 1475387142
